app/Controllers/ConsultasController.php

    public function index()
    {
        $data['consultas'] = $this->consultaModel->findAll();
---
SELECT *
FROM `consultas`