app/Controllers/ProductoController.php

    public function tabla()
    {
        $productos = $this->productoModel->where('eliminado', 'no')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'no'

    public function borrar($id)
    {
        $this->productoModel->update($id, ['eliminado' => 'si']);
---
UPDATE `productos` SET `eliminado` = 'si'
WHERE `productos`.`id_producto` IN ('1')

    public function eliminados()
    {
        $eliminados = $this->productoModel->where('eliminado', 'SI')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'SI'